benchmarks/runpod_h100sxm/benchmark_results_qwen3_32b_h100sxm_runpod/run_1_TP8_DP1_CTX15000_C100_P100_O128.txt
BENCHMARK: run_1_TP8_DP1_CTX15000_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x73e2b313a840>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15000, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/qwen3-32b', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_qwen3_32b_h100sxm_runpod', result_filename='run_1_TP8_DP1_CTX15000_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-a20fd4cd-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-29 04:10:44 [datasets.py:612] Sampling input_len from [15000, 15000] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:19<31:35, 19.15s/it]
  5%|▌         | 5/100 [00:19<04:33,  2.88s/it]
 11%|█         | 11/100 [00:19<01:31,  1.03s/it]
 17%|█▋        | 17/100 [00:19<00:45,  1.83it/s]
 23%|██▎       | 23/100 [00:19<00:25,  3.02it/s]
 29%|██▉       | 29/100 [00:19<00:15,  4.62it/s]
 35%|███▌      | 35/100 [00:19<00:09,  6.76it/s]
 43%|████▎     | 43/100 [00:19<00:05, 10.49it/s]
 51%|█████     | 51/100 [00:20<00:03, 15.28it/s]
 59%|█████▉    | 59/100 [00:20<00:01, 20.93it/s]
 68%|██████▊   | 68/100 [00:20<00:01, 28.69it/s]
 78%|███████▊  | 78/100 [00:20<00:00, 38.35it/s]
 91%|█████████ | 91/100 [00:20<00:00, 53.07it/s]
100%|██████████| 100/100 [00:20<00:00,  4.87it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  20.51     
Total input tokens:                      1500000   
Total generated tokens:                  12800     
Request throughput (req/s):              4.87      
Output token throughput (tok/s):         623.97    
Peak output token throughput (tok/s):    3766.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          73745.67  
---------------Time to First Token----------------
Mean TTFT (ms):                          9238.35   
Median TTFT (ms):                        9140.60   
P99 TTFT (ms):                           17863.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          84.33     
Median TPOT (ms):                        85.67     
P99 TPOT (ms):                           145.96    
---------------Inter-token Latency----------------
Mean ITL (ms):                           84.33     
Median ITL (ms):                         24.61     
P99 ITL (ms):                            221.13    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          19948.78  
Median E2EL (ms):                        20021.18  
P99 E2EL (ms):                           20460.23  
==================================================